Revit 2027 API
WorksetKindFilter Class
 A filter used to match worksets of the given WorksetKind.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.WorksetFilter
 Autodesk.Revit.DB.WorksetKindFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class WorksetKindFilter : WorksetFilter
Public Class WorksetKindFilter
	Inherits WorksetFilter
public ref class WorksetKindFilter : public WorksetFilter
type WorksetKindFilter =
    class
        inherit WorksetFilter
    end
The WorksetKindFilter type exposes the following members.
Constructors
Name | Description
WorksetKindFilter(WorksetKind) |  Constructs a new instance of WorksetKindFilter filter to match worksets of the given WorksetKind.
WorksetKindFilter(WorksetKind, Boolean) |  Constructs a new instance of WorksetKindFilter filter to match worksets of the given WorksetKind.
Top
Properties
Name | Description
IncludeStandaloneWorksetsOnly |  True if the results of the filter only match stand-alone worksets; worksets that are not stand-alone will be rejected.
(Inherited from WorksetFilter)
Inverted |  True if the results of the filter are inverted; worksets that would normally be accepted by this filter will be rejected, and worksets that would normally be rejected will be accepted.
(Inherited from WorksetFilter)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from WorksetFilter)
WorksetKind |  The WorksetKind.
Top
Methods
Name | Description
Dispose
(Inherited from WorksetFilter)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 This filter is a quick filter.
See Also
Reference
Autodesk.Revit.DB Namespace